Перем мЛоггер;
Перем мИдВызова;


#Область ПодключениеОбработкиКБСП

Функция СведенияОВнешнейОбработке() Экспорт

	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();

	ПараметрыРегистрации.Вставить("Вид",ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка());
	ПараметрыРегистрации.Вставить("Версия","1.01");
	//ПараметрыРегистрации.Вставить("Назначение", Новый Массив);
	ПараметрыРегистрации.Вставить("Наименование","Плагин_RabbitMQ_импорт_из_УПП_Справочник_Контрагенты");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация","Плагин_RabbitMQ_импорт_из_УПП_Справочник_Контрагенты");
	ПараметрыРегистрации.Вставить("ВерсияБСП", "3.1.5.180");
	//ПараметрыРегистрации.Вставить("ОпределитьНастройкиФормы", Ложь);
	
	ТипКоманды = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	ДобавитьКоманду(ПараметрыРегистрации.Команды, 
		"Открыть форму : Плагин_RabbitMQ_импорт_из_УПП_Справочник_Контрагенты",
		"Форма_Плагин_RabbitMQ_импорт_из_УПП_Справочник_Контрагенты",
		ТипКоманды, 
		Ложь) ;
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")

	//ТаблицаКоманд.Колонки.Добавить("Представление", РеквизитыТабличнойЧасти.Представление.Тип);
	//ТаблицаКоманд.Колонки.Добавить("Идентификатор", РеквизитыТабличнойЧасти.Идентификатор.Тип);
	//ТаблицаКоманд.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	//ТаблицаКоманд.Колонки.Добавить("ПоказыватьОповещение", РеквизитыТабличнойЧасти.ПоказыватьОповещение.Тип);
	//ТаблицаКоманд.Колонки.Добавить("Модификатор", РеквизитыТабличнойЧасти.Модификатор.Тип);
	//ТаблицаКоманд.Колонки.Добавить("Скрыть",      РеквизитыТабличнойЧасти.Скрыть.Тип);
	//ТаблицаКоманд.Колонки.Добавить("ЗаменяемыеКоманды", РеквизитыТабличнойЧасти.ЗаменяемыеКоманды.Тип);
	
//           ** Использование - Строка - тип команды:
//               "ВызовКлиентскогоМетода",
//               "ВызовСерверногоМетода",
//               "ЗаполнениеФормы",
//               "ОткрытиеФормы" или
//               "СценарийВБезопасномРежиме".
//               Для получения типов команд рекомендуется использовать функции
//               ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКоманды<ИмяТипа>.
//               В комментариях к этим функциям также даны шаблоны процедур-обработчиков команд.

	НоваяКоманда = ТаблицаКоманд.Добавить() ;
	НоваяКоманда.Представление = Представление ;
	НоваяКоманда.Идентификатор = Идентификатор ;
	НоваяКоманда.Использование = Использование ;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение ;
	НоваяКоманда.Модификатор = Модификатор ;
КонецПроцедуры

#КонецОбласти


// Описание_метода
//
// Параметры:
//	СтруктураОбъекта	- структура - после метода тДанные = ПрочитатьJSON(мЧтениеJSON,,,,"ФункцияВосстановленияJSON",ЭтотОбъект);//структура
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ЗагрузитьОбъект(СтруктураОбъекта) Экспорт

	//мЛоггер = мис_ЛоггерСервер.getLogger(мИдВызова, "Импорт НСИ из УПП: Контрагенты");
	
	Если НЕ НРег(СтруктураОбъекта.type) = "справочник.контрагенты" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	id = СтруктураОбъекта.identification;
	def = СтруктураОбъекта.definition;
	
	СуществующийОбъект = ПолучитьСсылкуСправочникаПоДаннымID(id, "Контрагенты");

	НачатьТранзакцию();
	
	Попытка
		
		Если НЕ ЗначениеЗаполнено(СуществующийОбъект.ВерсияДанных) Тогда
			
			ОбъектДанных = Справочники.Контрагенты.СоздатьЭлемент();
			ОбъектДанныхПартнер = Справочники.Партнеры.СоздатьЭлемент();
			ОбъектДанных.УстановитьНовыйКод();
			ОбъектДанныхПартнер.УстановитьНовыйКод();
			СсылкаНового = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(id.Ref));
			ОбъектДанных.УстановитьСсылкуНового(СсылкаНового);
			
		Иначе
			
			ОбъектДанных = СуществующийОбъект.ПолучитьОбъект();
			Если ОбъектДанных.Партнер = Справочники.Партнеры.ПустаяСсылка() Тогда
				ОбъектДанныхПартнер = Справочники.Партнеры.СоздатьЭлемент();
			Иначе
				ОбъектДанныхПартнер = ОбъектДанных.Партнер.ПолучитьОбъект();
			КонецЕсли
			
		КонецЕсли;
		
		ОбъектДанных.ПометкаУдаления = def.DeletionMark;
		ОбъектДанных.Наименование = def.Наименование;
		ОбъектДанных.НаименованиеПолное = def.НаименованиеПолное;
		
		Если ОбъектДанныхПартнер <> Справочники.Партнеры.ПустаяСсылка() Тогда
			ОбъектДанныхПартнер.Наименование = def.Наименование;
			ОбъектДанныхПартнер.НаименованиеПолное = def.НаименованиеПолное;
		КонецЕсли;
		
		ОбъектДанных.ОбособленноеПодразделение = def.ОбособленноеПодразделение;
		
		НайденноеЗначение = "";
		Если def.ЮридическоеФизическоеЛицо.Свойство("Значение", НайденноеЗначение) Тогда
			ОбъектДанных.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо[НайденноеЗначение];
		КонецЕсли;
		
		ОбъектДанных.СтранаРегистрации = ПолучитьСсылкуСправочникаПоДаннымID(def.СтранаРегистрации, "СтраныМира");
		
		ОбъектДанных.ГоловнойКонтрагент = ПолучитьСсылкуСправочникаПоДаннымID(def.ГоловнойКонтрагент, "Контрагенты");
		
		ОбъектДанных.КПП = def.КПП;
		ОбъектДанных.ИНН = def.ИНН;
		
		ОбъектДанных.ДополнительнаяИнформация = def.ДополнительнаяИнформация;
		
		НайденноеЗначение = "";
		Если def.ЮрФизЛицо.Свойство("Значение", НайденноеЗначение) Тогда
			ОбъектДанных.ЮрФизЛицо = Перечисления.ЮрФизЛицо[НайденноеЗначение];
			Если НСтр(НайденноеЗначение) = НСтр("ЮрЛицо") ИЛИ НСтр(НайденноеЗначение) = НСтр("ЮрЛицоНеРезидент") Тогда
				ОбъектДанныхПартнер.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.Компания;
			Иначе
				ОбъектДанныхПартнер.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо;
			КонецЕсли; 
		КонецЕсли;
		
		ОбъектДанных.НДСПоСтавкам4и2 = def.НДСПоСтавкам4и2;
		
		ОбъектДанных.КодПоОКПО = def.КодПоОКПО;
		
		//ОбъектДанных.РегистрационныйНомер
		//ОбъектДанных.НалоговыйНомер
		//ОбъектДанных.НаименованиеМеждународное
		//ОбъектДанных.КСП_ОтгрузкаЗаказовКлиентаТребуетПодписания
		//ОбъектДанных.КСП_ИмеетсяБанковскаяГарантия
		//ОбъектДанных.КСП_ОписаниеБанковскойГарантии
		//ОбъектДанных.КСП_ТребуетПодписанияСпецификации
		
		//"ТЧКонтактнаяИнформация"
		//"ТЧДополнительныеРеквизиты"
		//"ТЧИсторияКПП"
		//"ТЧИсторияНаименований"
		
		ОбъектДанныхПартнер.ОбменДанными.Загрузка = Истина;
		ОбъектДанныхПартнер.Записать(); 
		
		ОбъектДанных.Партнер = ОбъектДанныхПартнер.Ссылка;
		ОбъектДанных.ОбменДанными.Загрузка = Истина;
		ОбъектДанных.Записать();
		
		ЗафиксироватьТранзакцию();
		
		//мЛоггер.инфо("Загружены: Контрагент : 1, Партнер : %2", ОбъектДанных, ОбъектДанныхПартнер);
		
		Возврат ОбъектДанных.Ссылка;
		
	Исключение
		
		ОтменитьТранзакцию();
		т = ОписаниеОшибки();
		мЛоггер.ерр("Ошибка импорта контрагента: %1", т);
		ВызватьИсключение; //retry-queue
		
	КонецПопытки;
	
КонецФункции


Функция ПолучитьСсылкуСправочникаПоДаннымID(СтруктураID, ВидОбъекта) Экспорт
	
	Если Не ТипЗнч(СтруктураID) = Тип("Структура") Тогда
		Возврат Справочники[ВидОбъекта].ПустаяСсылка();
	КонецЕсли;
	
	ГУИД = "";
	Если СтруктураID.Свойство("Ref", ГУИД) Тогда
		Если НЕ ЗначениеЗаполнено(ГУИД) ИЛИ ГУИД="00000000-0000-0000-0000-000000000000" Тогда
			Возврат Справочники[ВидОбъекта].ПустаяСсылка();
		КонецЕсли;
		Возврат Справочники[ВидОбъекта].ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));
	Иначе
		Возврат Справочники[ВидОбъекта].ПустаяСсылка();
	КонецЕсли;
	
КонецФункции


#Область Тестирование


// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ЗагрузитьИзJsonНаСервере(Json) export


	мЧтениеJSON = Новый ЧтениеJSON;

	
	мЧтениеJSON.УстановитьСтроку(Json);
		
	СтруктураОбъекта = ПрочитатьJSON(мЧтениеJSON,,,,"ФункцияВосстановленияJSON",ЭтотОбъект);//структура

	
	
	Возврат ЗагрузитьОбъект(СтруктураОбъекта);
	
КонецФункции

Функция ФункцияВосстановленияJSON(Свойство, Значение, ДопПараметры) Экспорт
	
	Если Свойство = "Date"Тогда
		Возврат ПрочитатьДатуJSON(Значение, ФорматДатыJSON.ISO);
	КонецЕсли;
	Если Свойство = "Период"Тогда
		Возврат ПрочитатьДатуJSON(Значение, ФорматДатыJSON.ISO);
	КонецЕсли;
	Если Свойство = "Сумма" Тогда
		Возврат XMLЗначение(Тип("Число"),Значение);
	КонецЕсли;
	Если Свойство = "Валюта" Тогда
		Возврат Справочники.Валюты.НайтиПоКоду(Значение);
	КонецЕсли;
	
КонецФункции


#КонецОбласти 	


// Описание_метода
//
// Параметры:
//  Параметр1   - Тип1 -
//
Функция сетИдВызова(пИдВызова) Экспорт
     
    мИдВызова = пИдВызова;
    Возврат ЭтотОбъект;
     
КонецФункции


