&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для каждого стрк Из Метаданные.Документы Цикл
		Элементы.ВидДокументов.СписокВыбора.Добавить(стрк.имя);
	КонецЦикла;
КонецПроцедуры



&НаСервере
Процедура ВыполнитьОтложенноеПроведениеНаСервере()
	РеквизитФормыВЗначение("Объект").ВыполнитьОтложенноеПроведение();
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьОтложенноеПроведение(Команда)
	ВыполнитьОтложенноеПроведениеНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПровестиОдинДокументНаСервере()
	РеквизитФормыВЗначение("Объект").ПровестиОдинДокумент(ДокументСсылка);
КонецПроцедуры


&НаКлиенте
Процедура ПровестиОдинДокумент(Команда)
	ПровестиОдинДокументНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПровестиЗаПериодВидДокументовНаСервере()
	РеквизитФормыВЗначение("Объект").ПровестиВидДокументов(ВидДокументов, ПериодПроведения.ДатаНачала, ПериодПроведения.ДатаОкончания);
КонецПроцедуры


&НаКлиенте
Процедура ПровестиЗаПериодВидДокументов(Команда)
	ПровестиЗаПериодВидДокументовНаСервере();
КонецПроцедуры


